[
  {
    "id": 0,
    "sanskrit_name": "",
    "english_name": "",
    "procedure": [],
    "target_body_parts": [],
    "contraindications": [],
    "benefits": [],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 0,
    "sanskrit_name": "Navasana",
    "english_name": "Boat Pose",
    "procedure": [
      "Lie on your back with your feet together and arms beside your body.",
      "Take a deep breath in and as you exhale, lift your chest and feet off the ground, stretching your arms towards your feet.",
      "Your eyes, fingers and toes should be in a line.",
      "Feel the tension in your navel area as the abdominal muscles contract.",
      "Keep breathing deeply and easily while maintaining the pose.",
      "As you exhale, come back to the ground slowly and relax."
    ],
    "target_body_parts": ["Core", "Abdominal Muscle", "Back", "Spine"],
    "benefits": [
      "Strengthens the back and abdominal muscles.",
      "Tones the leg and arm muscles.",
      "Useful for people with hernia."
    ],
    "contraindications": [
      "Blood Pressure Issues",
      "Spinal Disorders",
      "Asthma",
      "Heart Patients",
      "Pregnancy",
      "Menstrual Cycle",
      "Neck Injury",
      "Back Injury"
    ],
    "created_at": "2022-02-11T19:41:32",
    "updated_at": "2022-02-11T19:41:32",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 1,
    "sanskrit_name": "Ardha Navasana",
    "english_name": "Half-Boat Pose",
    "procedure": [
      "Sit on your yoga mat and stretch your legs in front of you, keep them straight.",
      "Now interlock your fingers and put them on the back of your head, just above your neck.",
      "Breath out, move your upper body slightly back, and simultaneously raise your legs from the floor. Keep your knees tight and your toes pointed forward.",
      "Your spine should not contact the floor, and your body weight should be evenly distributed on your buttocks. You will experience the grasp of the muscles on your abdomen and the lower back.",
      "Maintain a 30- to 35-degree angle between your legs and the floor with your legs straight and your forehead in line with your toes.",
      "Stay in this pose for about 15 to 20 seconds with normal breathing. If you can hold this pose for about one minute or more it shows you have strong abdominal muscles."
    ],
    "target_body_parts": ["Core", "Abdominal Muscle", "Back", "Spine"],
    "benefits": [
      "Strengthens the back and abdominal muscles.",
      "Tones the leg and arm muscles.",
      "Useful for people with hernia."
    ],
    "contraindications": [
      "Blood Pressure Issues",
      "Spinal Disorders",
      "Asthma",
      "Heart Patients",
      "Pregnancy",
      "Menstrual Cycle",
      "Neck Injury",
      "Back Injury"
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 2,
    "sanskrit_name": "Dhanurasana",
    "english_name": "Bow Pose",
    "procedure": [
      "Lie on your stomach with your feet apart, in line with your hips, and your arms by the side of your body.",
      "Fold your knees, take your hands backward, and hold your ankles.",
      "Breathe in, and lift your chest off the ground and pull your legs up and towards the back. ",
      "Look straight ahead with a smile on your face.",
      "Keep the pose stable while paying attention to your breath. Your body is now curved and as taut as a bow.",
      "Continue to take long, deep breaths as you relax in this pose. But, bend only as far as your body permits you to. Do not overdo the stretch.",
      "After 15 -20 seconds, as you exhale, gently bring your legs and chest to the ground. Release the ankles and relax."
    ],
    "target_body_parts": [
      "Core",
      "Abdominal Muscle",
      "Back",
      "Spine",
      "Reproductive Organs",
      "Chest",
      "Neck"
    ],
    "benefits": [
      "Strengthens the back and abdominal muscles.",
      "Stimulates the reproductive organs.",
      "Opens up the chest, neck, and shoulders.",
      "Tones the leg and arm muscles.",
      "Adds greater flexibility to the back.",
      "Alleviates stress and fatigue.",
      "Relieves menstrual discomfort and constipation.",
      "Helps people with renal (kidney) disorders."
    ],
    "contraindications": [
      "Blood Pressure Issues",
      "Spinal Disorders",
      "Pregnancy",
      "Menstrual Cycle",
      "Neck Injury",
      "Back Injury",
      "Hernia",
      "Migraine"
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 3,
    "sanskrit_name": "Setu Bandha Sarvangasana",
    "english_name": "Bridge Pose",
    "procedure": [
      "To begin, lie on your back.",
      "Fold your knees and keep your feet hip distance apart on the floor, 10-12 inches from your pelvis, with knees and ankles in a straight line.",
      "Keep your arms beside your body, palms facing down.",
      "Inhaling, slowly lift your lower back, middle back and upper back off the floor; gently roll in the shoulders; touch the chest to the chin without bringing the chin down, supporting your weight with your shoulders, arms and feet. Feel your bottom firm up in this pose. Both the thighs are parallel to each other and to the floor.",
      "If you wish, you could interlace the fingers and push the hands on the floor to lift the torso a little more up, or you could support your back with your palms.",
      "Keep breathing easily.",
      "Hold the posture for a minute or two and exhale as you gently release this yoga pose."
    ],
    "target_body_parts": [
      "Core",
      "Abdominal Muscle",
      "Back",
      "Spine",
      "Neck",
      "Chest",
      "Respiratory Muscles"
    ],
    "benefits": [
      "Strengthens the back muscles.",
      "Relieves the tired back instantaneously.",
      "Gives a good stretch to the chest, neck and spine.",
      "Calms the brain, reducing anxiety, stress and depression.",
      "Opens up the lungs and reduces thyroid problems.",
      "Helps improve digestion.",
      "Helps relieve the symptoms of menopause and menstrual pain.",
      "Helpful in asthma, high blood pressure, osteoporosis, and sinusitis."
    ],
    "contraindications": ["Neck Injury", "Back Injury"],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 4,
    "sanskrit_name": "Baddha Konasana",
    "english_name": "Butterfly Pose",
    "procedure": [
      "Sit with your spine erect and legs spread straight out.",
      "Now bend your knees and bring your feet towards the pelvis. The soles of your feet should touch each other.",
      "Grab your feet tightly with your hands. You may place the hands underneath the feet for support.",
      "Make an effort to bring the heels as close to the genitals as possible.",
      "Take a deep breath in. Breathing out, press the thighs and knees downward towards the floor. Make a gentle effort to keep pressing them downward.",
      "Now start flapping both the legs up and down like the wings of a butterfly. Start slow and gradually increase the speed. Keep breathing normally throughout.",
      "Fly higher and higher, as fast as you comfortably can. Slow down and then stop. Take a deep breath in and as you exhale, bend forward, keeping the chin up and spine erect.",
      "Press your elbows on the thighs or on the knees, pushing the knees and thighs closer to the floor.",
      "Feel the stretch in the inner thighs and take long, deep breaths, relaxing the muscles more and more.",
      "Take a deep breath in and bring the torso up.",
      "As you exhale, gently release the posture. Straighten the legs out in front of you and relax."
    ],
    "target_body_parts": ["Thighs", "Knees", "Groins", "Hip"],
    "benefits": [
      "A good stretch for the inner thighs, groins and knees, improving flexibility in the groin and hip region",
      "Helps in intestine and bowel movement",
      "Removes fatigue from long hours of standing and walking",
      "Offers relief from menstrual discomfort and menopause symptoms",
      "Helps in smooth delivery if practiced regularly until late pregnancy"
    ],
    "contraindications": [
      "Knee Injury",
      "Sciatica Patients",
      "Lower-back Disorders"
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 5,
    "sanskrit_name": "Ustrasana",
    "english_name": "Camel Pose",
    "procedure": [
      "First of all, kneel down on the floor.Keep your thighs and feet together.Toes should be pointing back and resting on the floor.",
      "Bring the knees and the feet about one foot apart and stand on the knees.",
      "Inhale, bend backward slowly.",
      "Exhale; place the right palm on the right heel and left palm on the left heel.",
      "The thighs should be vertical to the floor and the head tilted backward.The weight of the body should be evenly supported by the arms and legs.",
      "Maintain the pose as long as you can.",
      "Exhale and come to the original position slowly."
    ],
    "target_body_parts": [
      "Back",
      "Spine",
      "Shoulders",
      "Core",
      "Abdominal Muscle"
    ],
    "benefits": [
      "Improves digestion.Stretches and opens the front of the body. It also strengthens the back and shoulders.",
      "Relieves the body of lower back ache.",
      "Improves flexibility of the spine and also improves posture.",
      "Helps overcome menstrual discomfort."
    ],
    "contraindications": [
      "Back Injury",
      "Neck Injury",
      "Blood Pressure Issues"
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 6,
    "sanskrit_name": "Marjaryasana-Bitilasana",
    "english_name": "Cat-Cow Pose",
    "procedure": [
      "Begin on your hands and knees, with your wrists directly under your shoulders and your knees directly under your hips",
      "Inhale and look up towards the ceiling, arching your back and lowering your belly towards the ground",
      "Exhale and tuck your chin towards your chest, rounding your spine and bringing your belly button towards your spine",
      "Repeat these movements, inhaling as you look up and exhaling as you round your spine",
      "Continue for several breaths, moving slowly and mindfully",
      "When you're ready to release the pose, come back to a neutral tabletop position"
    ],
    "target_body_parts": ["Back", "Spine", "Abdominal Muscle", "Core", "Neck"],
    "benefits": [
      "Helps provide sturdiness and overall durability to your spinal column thus improving your posture.",
      "Stretches our your back and torso while relieving tension in your lower back.",
      "Helps to regulate blood circulation throughout your body.",
      "The movements in the asana massage your digestive organs and activate them. As a result, the process of digestion is improved.",
      "For women, the asana can soothe menstrual cramps and stiffness."
    ],
    "contraindications": ["Pregnancy", "Neck Injury", "Knee Injury"],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 7,
    "sanskrit_name": "Utkatasana",
    "english_name": "Chair Pose",
    "procedure": [
      "Stand erect with your feet slightly apart.",
      "Stretch your hands to the front with palms facing downwards. Do not bend your elbows.",
      "Bend the knees and gently push your pelvis down as if you are sitting in an imaginary chair.",
      "Be comfortable or at least try to be! To get a better feel of the Chair Pose.",
      "Ensure that you keep your hands parallel to the ground.",
      "Sink deeper into the chair by gradually going down but ensure that your knees don’t go beyond your toes.",
      "Keep going down slowly and then sit down in Sukhasana (cross-legged posture). If you want, you may lie down on your back and relax."
    ],
    "target_body_parts": ["Spine", "Hip", "Thighs", "Legs", "Knees", "Ankle"],
    "benefits": [
      "Helps strengthen the lower back and torso",
      "Tones the thigh, ankle, leg and knee muscles",
      "Holding the chair pose can help improve stamina and your ability to hold yoga poses for longer.",
      "Chair pose requires you to stabilize your lower body and can help you achieve better balance and posture."
    ],
    "contraindications": [
      "Menstrual Cycle",
      "Pregnancy",
      "Leg Injury",
      "Spine Injury"
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 8,
    "sanskrit_name": "Balasana",
    "english_name": "Child's Pose",
    "procedure": [
      "Sit on your knees on the yoga mats i.e. Vajrasana. In this case, rest your upper body on the thighs.",
      "Keep both knees of your feet sticking to each other or at a short distance from each other and keep the waist perfectly straight.",
      "Now take a deep breath and tilt the upper body towards the front such that chest may rest gently on the thighs.",
      "Stretch your arms out in front with the palms facing the floor. You may also move the arms towards the back, with the palms facing upwards.",
      "Stay in the post for a few minutes, and return to the initial sitting posture. Now, gradually open your eyes.",
      "To get out of this easy, first, bring your palms under the shoulder and slowly raise your upper body and return to the Vajrasana.",
      "In the end, rub your hands together and gently place them on your eyes and face to experience their warmth."
    ],
    "target_body_parts": ["Spine", "Back", "Hip", "Thighs", "Ankle"],
    "benefits": [
      "It stretches your lower back and relaxes the spine.",
      "It strengthens and stretches your thighs, ankles and muscle of hips.",
      "While doing Balasana yoga asana, there is pressure on your stomach and intestines which also enhances the digestive process."
    ],
    "contraindications": [
      "Pregnancy",
      "Spine Injury",
      "Knee Injury",
      "Blood Pressure Issues"
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 9,
    "sanskrit_name": "Savasana",
    "english_name": "Corpse Pose",
    "procedure": [
      "Lie flat on your back, preferably without any props or cushions. Use small pillow below your neck if absolutely required. Close your eyes.",
      "Keep your legs comfortable apart and let your feet and knees relax completely.",
      "Place your arms alongside, yet a little spread apart from your body. Leave your palms open, facing upward.",
      "Taking your attention to different body parts one by one, slowly relax your entire body.",
      "After some time, about 10-20minutes when you feel fully relaxed, keeping your eyes closed, slowly roll onto your left side. Lie in that position for a minute or so & then move to your right side.",
      "Taking the support of your right hand, gently sit up into a seated pose such as Sukhasana (Easy Pose).",
      "Keep your eyes closed and take a few deep breaths in and out as you gradually become aware of your environment and the body. When you feel complete, slowly and gently open your eyes."
    ],
    "target_body_parts": ["Each part of body at cellular level"],
    "benefits": [
      "This posture brings a deep, meditative state of rest, which may help in the repair of tissues and cells, and in releasing stress. It also gives time for the yoga workout to sink in at a deeper level.",
      "This posture leaves you in a state of rejuvenation. It is the perfect way to end a yoga session, particularly if it has been a fast-paced one.",
      "It helps reduce blood pressure, anxiety, and insomnia.",
      "This is an excellent way to ground the body and reduce the Vata dosha(imbalance of the air element) in the body."
    ],
    "contraindications": ["Back Injury"],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 10,
    "sanskrit_name": "Bakasana",
    "english_name": "Crow Pose",
    "procedure": [
      "Place your palms firmly on the mat about shoulder-width apart.",
      "Fix your gaze straight ahead.",
      "Lift your hips up, gradually lean forward, and adjust the knees to touch the upper arms near the armpits.",
      "Lift one foot off the ground and then the other keeping the knees bent.",
      "Put your feet on the floor and shift your weight back."
    ],
    "target_body_parts": [
      "Wrists",
      "Arms",
      "Abdominal Muscle",
      "Shoulders",
      "Core",
      "Pelvic Muscle"
    ],
    "benefits": [
      "Regular practice of this pose will increase mental and physical strength.",
      "Helps in to make your body more flexible.",
      "Practicing this posture on a daily routine helps you in strengthening your forearms, wrists, and shoulders.",
      "Balances nervous system and strengthens the core."
    ],
    "contraindications": [
      "Shoulder Injury",
      "Hamstrings",
      "High Blood Pressure Issues",
      "Pregnancy",
      "Menstrual Cycle",
      "Wrist Pain",
      "Thrombosis (blood clot in the brain)"
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 11,
    "sanskrit_name": "Ardha Pincha Mayurasana",
    "english_name": "Dolphin Pose",
    "procedure": [
      "Start by coming into all fours, keeping a neutral spine.",
      "Slowly and gently bring your forearms down to the floor.",
      "Your elbows should be directly underneath your shoulders.",
      "Gently tuck your toes under and lift your knees off the floor.",
      "Then, lift your tail bone higher towards the ceiling.",
      "Walk your feet in towards your hands if needed, or away if you need more space.",
      "Make sure to keep a neutral spine and avoid arching the back.",
      "Engage your core muscles to avoid overarching or sinking into the low back.",
      "Hold this pose for few breaths, and release by going back to table top position."
    ],
    "target_body_parts": [
      "Upper Body",
      "Shoulders",
      "Neck",
      "Arms",
      "Legs",
      "Spine"
    ],
    "benefits": [
      "Ardha Pincha Mayurasana calms your mind, and relieving depression.",
      "It stretches shoulder, aches of the feet, Claves and hamstrings.",
      "Strengthens your arms and legs.",
      "Dolphin Pose helps to stimulate the reproductive organs, relieve menstrual discomfort, and reduce the symptoms of menopause.",
      "Stimulates the digestive organs and also improves digestion.",
      "It lengthens the spine, stretches the hamstrings, builds upper body strength, and stimulates the nervous system.",
      "The practice of this asana increases the supply of blood towards the head"
    ],
    "contraindications": ["Neck Injury", "Shoulder Injury", "Back Injury"],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 12,
    "sanskrit_name": "Adho Mukha Svanasana",
    "english_name": "Downward-Facing Dog",
    "procedure": [
      "Come onto your fours. Form a table such that your back forms the table top and your hands and feet form the legs of the table.",
      "As you breath out lift the hips up, straightening the knees and elbows, form an inverted V-shape with the body.",
      "Hands are shoulder width apart, feet are hip width apart and parallel to each other. Toes point straight ahead.",
      "Press your hands into the ground. Widen through the shoulder blades. Keep the neck lengthened by touching the ears to the inner arms.",
      "Hold the downward dog pose and take long deep breaths. Look towards the navel.",
      "Exhale. Bend the knees, return to table pose. Relax."
    ],
    "target_body_parts": [
      "Upper Body",
      "Shoulders",
      "Neck",
      "Arms",
      "Legs",
      "Spine"
    ],
    "benefits": [
      "It energizes and rejuvenates the body",
      "t lengthens the spine, strengthens the muscles of the chest increasing lung capacity",
      "It brings strength throughout the body especially the arms, shoulders, legs, feet",
      "It increases circulation to the brain"
    ],
    "contraindications": [
      "High Blood Pressure Issues",
      "Weak Eye Capillaries",
      "Shoulder Injury"
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 13,
    "sanskrit_name": "Garudasana",
    "english_name": "Eagle Pose",
    "procedure": [
      "Stand straight on both feet. Raise the right leg and wrap it around the left leg",
      "The right thigh should be over the left thigh and the right feet will touch the calf muscles from behind.",
      "Similarly wrap the right hand around the left hand & bring them closer to the face.",
      "Now place the palms together to resemble the beak of an eagle.",
      "Try to maintain the balance and slowly bend the left leg and lower the body until right toes touch the ground.",
      "Focus the eyesight on the tips of the fingers & try to remain in this pose for long as you can maintain the balance.",
      "Now straighten the left leg and unwrap the right leg. Also release the right arm and come to normal standing position.",
      "Relax for sometime and repeat the same process with opposite leg."
    ],
    "target_body_parts": ["Arms", "Legs", "Ankle", "Hip", "Thighs"],
    "benefits": [
      "It improves the flexibility of the arms and legs.",
      "It can loosen the joints of the legs",
      "It alleviates sciatica and rheumatism in the leg joints."
    ],
    "contraindications": ["Knee Injury", "Ankle Injury", "Elbow Injury"],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 14,
    "sanskrit_name": "Utthita Hasta Padangusthasana",
    "english_name": "Extended Hand to Toe",
    "procedure": [
      "Stand straight with your feet together and relax your entire body.",
      "Concentrate on a fixed point in front of you, keeping your head straight.",
      "Now, bend your right knee and bring your thigh as close to your chest as possible.",
      "Take the hold of the big toe of the right foot by sliding your right arm around the outside of the bent right knee. Make sure that you do not strain the leg muscles.",
      "Once you have held your toe, straighten your right leg in front of your body.",
      "With the left arm, try and balance the body. You can perform jnana mudra with your left hand. Jnana mudra is a hand pose where you tuck the tip of the index finger under the tip of the thumb, keeping the remaining three fingers lightly extended.",
      "Hold the final leg position for as long as you feel comfortable.",
      "While releasing, bend the knee first, then release the toe and slowly lower your foot to the floor.",
      "Relax the arms before repeating on the other side."
    ],
    "target_body_parts": ["Hip", "Legs", "Ankle"],
    "benefits": [
      "This asana helps in coordinating the muscular and nervous balance.",
      "This pose helps in strengthening and toning the hips and leg muscles.",
      "This asana strengthens the hamstring and adductor muscle of the hips.",
      "It also acts as a good hip opening exercise thus providing a good range of motion and blood circulation.",
      "This asana helps in improving the balance and strength of the ankles as the entire body is stabilised on one leg."
    ],
    "contraindications": ["Knee Injury", "Ankle Injury"],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 15,
    "sanskrit_name": "Utthita Parsvakonasana",
    "english_name": "Extended Side Angle",
    "procedure": [
      "First, stand in tadasana (stand straight with your feet at shoulder level and hands by your side).",
      "Take a deep breath, and with a jump, spread your legs a few feet apart.",
      "Now breathe out and stretch your left leg sideways at ninety-degree to the right leg. Your left leg will be bent at the knee and the left shoulder will be near the left knee in this posture.",
      "Place the left palm on the floor behind the left knee.",
      "Next, raise your right arm sideways; the right arm and right leg will now be in a straight line.",
      "Remain in this position for about thirty seconds to a minute. Breathe deeply and slowly come back to tadasana."
    ],
    "target_body_parts": ["Legs", "Shoulders", "Knees", "Digestion"],
    "contraindications": [
      "Migraine",
      "High Blood Pressure Issues",
      "Knee Injury"
    ],
    "benefits": [
      "Reduces backache.",
      "Strengthens the legs.",
      "Reduces menstrual discomfort.",
      "Can help with sciatica symptoms.",
      "Helps athletes tone their calves and hamstrings.",
      "Helps in expanding the chest, arms, and shoulder muscles. ",
      "This improves respiration and offers the entire body a burst of energy."
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 16,
    "sanskrit_name": "Pincha Mayurasana",
    "english_name": "Forearm Stand",
    "procedure": [
      "Start in Tabletop with your palms and forearms on the floor. Your forearms should be parallel to each other at shoulder width.",
      "Make sure that your elbows are right underneath your shoulders and your elbows are not opening or slipping out.",
      "Inhale and raise your left leg after achieving balance with your right leg and then slowly raise right leg as well up to the sky.",
      "Hold this position for 15 to 20 seconds. With constant practice, its length may be extended.",
      "As you fully exhale, lower your left leg from the posture and then your right leg."
    ],
    "target_body_parts": ["Core", "Arms", "Chest", "Back", "Lower Body"],
    "contraindications": [
      "Pregnancy",
      "High Blood Pressure Issues",
      "Neck Injury",
      "Shoulder Injury"
    ],
    "benefits": [
      "Improves blood flow to the brain",
      "Releases joint stiffness and tension while stretching your body",
      "Strengthens your core, back, chest, arms, shoulders, thighs, and buttocks (glutes)."
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 17,
    "sanskrit_name": "Uttanasana",
    "english_name": "Forward Bend with Shoulder Opener",
    "procedure": [
      "Start by standing in Tadasana and balance your weight equally on both feet.",
      "Breathing in, extend your arms overhead.",
      "Breathing out, bend forward with a flat back and down towards your feet.",
      "Stay in the posture for 20-30 seconds and continue to breath deeply.",
      "Keep your legs and spine erect with hands resting either on the floor, beside your feet or on your legs.",
      "Fully release all tension in your head and neck. Let your head hang and hold the fold.",
      "Breathing in, stretch your arms forward and up and slowly up to a standing position.",
      "Focus on coming out of the pose vertebra-by-vertebra. Your head should be the last to rise."
    ],
    "target_body_parts": ["Abdominal Muscle", "Legs", "Neck", "Hamstrings"],
    "contraindications": ["Back Injury", "Leg Injury", "Neck Injury"],
    "benefits": [
      "Helps improve posture",
      "Helps relieve back stiffness and neck tension",
      "Increases hip flexibility",
      "Increases blood flow to the brain",
      "Tones the abdominal organs"
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 18,
    "sanskrit_name": "Ardha Chandrasana",
    "english_name": "Half-Moon",
    "procedure": [
      "Begin this yoga posture by standing straight in the Tadasana or the mountain pose. Place your feet apart from each other while keeping them in a parallel position to the outer edges.",
      "Take a step forward with your left leg. Bend the left knee and stretch the right leg backward fully. Place the right toes and knee on the floor. To get the balance, place the palms on the floor.",
      "Keep the torso and head straight. Take a couple of deep breaths. Inhale and slowly raise the arms. Press the palms together and place them before the chest in.Anjali Mudra. Take a couple of deep breaths.",
      "Inhale and raise the arms over the head without releasing Anjali Mudra. Bend the upper torso further back by simultaneously bending the arms back to the convenient maximum level. Ensure that arms are in Anjali Mudra. The arms, back, and the right leg should form a curve like a half-moon. Breath slowly.",
      "Keep the position as long as it is comfortable. After releasing the pose, go to Corpse Pose for one or two minutes. Then repeat the steps by changing the legs."
    ],
    "target_body_parts": ["Thighs", "Core", "Lower Body", "Abdominal Muscle"],
    "contraindications": [
      "Pregnancy",
      "Menstrual Cycle",
      "High Blood Pressure Issues",
      "Hernia"
    ],
    "benefits": [
      "Strengthens your thigh muscles, pelvis, calves, and ankles, core, the entire lower body",
      "It might have some enhancing effects to help in healthy blood circulation, a well-regulated and healthy digestive system, and constipation relief. ",
      "It might be beneficial for adrenal gland regulation and keeping balance on both sides of the body."
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 19,
    "sanskrit_name": "Adho Mukha Vrksasana",
    "english_name": "Handstand",
    "procedure": [
      "To do this, start in Tadasana facing the wall. Now get on all fours onto the ground. Ensure that you are away from the wall by a span of one hand length. Place the palms shoulder-width apart and completely stretch out.",
      "Place the hands so that the middle finger is towards the wall and all the other fingers are stretched out completely.",
      "Move your legs back to about half of the mat. This should resemble the downward dog pose. The feet should be close to the hands and about 1 meter away from the hands. From this position, kick one leg up and then follow it up with the other after gaining momentum. Take the support of the wall to practice balance.",
      "Once you feel confident, move one foot away from the wall and then both. After you have practised this, try this out from the wall, probably at the centre of the room. While doing the yoga handstand, make sure to keep the legs and arms straight, toes dorsiflexed, and the neck and head relaxed.",
      "To release from this position, breathe slowly and deeply. Bring down the limbs one at a time and then back to the downward dog pose and back to Tadasana."
    ],
    "target_body_parts": ["Shoulders", "Core", "Legs"],
    "contraindications": [
      "Pregnancy",
      "Blood Pressure Issues",
      "Heart Patients",
      "Shoulder Injury",
      "Wrist Pain"
    ],
    "benefits": [
      "Boosts breathing capacity as it fully expands the chest.",
      "Strengthens the hand, arms, wrist, and shoulder muscles.",
      "Stretches the abdominal muscles and boosts digestion.",
      "Improves the balance and coordination of the body.",
      "Improves cardiovascular endurance and activates the baroreceptors in the carotid arteries."
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 20,
    "sanskrit_name": "Anjaneyasana",
    "english_name": "Low Lunge",
    "procedure": [
      "First, stand in Tadasana. In this pose, your body is in a straight, aligned position.",
      "Next, stretch your left leg back fully with the lower left leg (part of the left leg below the knee) touching the floor.",
      "Bend your right leg at the knee and ensure the right foot is placed in front of the left foot. The legs should be placed at a distance that avoids wobbling legs.",
      "Next, stretch your arms over your head in the namaskar position.",
      "This asana depicts lord hanuman, the son of Anjani; hence it is called Anjaneyasana.",
      "Breathe normally and hold this position for 3-5 minutes.",
      "Breathe out and return to the original position.",
      "Repeat the above steps with alternate legs."
    ],
    "target_body_parts": ["Glutes", "Legs", "Shoulders", "Core", "Lower Body"],
    "contraindications": [
      "Knee Injury",
      "High Blood Pressure Issues",
      "Neck Injury"
    ],
    "benefits": [
      "It opens up your shoulders, lungs, and chest.",
      "Low Lunge Pose helps you improve your balance.",
      "Low Lunge Pose stimulates the digestive and reproductive organs.",
      "If you practice this asana regularly, your body will be toned and energized."
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 21,
    "sanskrit_name": "Supta Kapotasana",
    "english_name": "Reclining Pigeon",
    "procedure": [
      "Lie down on your back with bent knees and feet on the floor.",
      "Lift the right foot and place the right ankle on the left thigh near the knee.",
      "Thread your right arm between the legs.",
      "Clasp right hand with the left around the left shin.",
      "Bring the left knee closer to the chest lifting the left foot off the floor.",
      "Set your gaze towards the ceiling.",
      "Exhale and feel the stretch around the lower hip.",
      "Hold the pose for up to 3 breaths then release the pose in reverse order.",
      "Repeat these steps keeping the right ankle over the left thigh.",
      "Once done on both sides, relax lying on the floor."
    ],
    "target_body_parts": ["Hips", "Thighs", "Lower Back", "Digestive Organs"],
    "contraindications": ["Knee Injury", "Pregnancy", "Hips Injury"],
    "benefits": [
      "It stretches the hips.",
      "It strengthens the thighs.",
      "It provides flexible lower back.",
      "It provides better digestion."
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 22,
    "sanskrit_name": "Eka Pada Rajakapotasana",
    "english_name": "One-legged Pigeon Pose",
    "procedure": [
      "Sit in Dandasana (Staff Pose). Bend your right knee and place your foot on the floor just in front of your right sitting bone so that your shin is approximately perpendicular to the floor.",
      "Shift slightly to the right and swing your left leg straight back behind your torso.",
      "Place your hands on the floor in front of you for support as you adjust your back leg so that your left leg is fully extended, with the front of the leg and top of the foot on the floor.",
      "Bend your left knee and raise the shin approximately perpendicular to the floor.",
      "Balance your weight on your right foot and left knee. To stabilize your position, push your right knee forward until it protrudes slightly beyond your toes.",
      "Inhale as you lift your right arm up and reach back.  Exhale and take the left foot in your hand.  Then do the same with your left arm. Holding the foot firmly, lift your chest and drop your head back toward the sole of your left foot. Keep your arms toward the midline of your body and your elbows reaching toward the ceiling.",
      "Hold for about 15 to 30 seconds, breathing as smoothly as possible.",
      "Exhale and release your foot, bringing the leg back to the floor. Repeat steps 1 through 4 on the opposite side."
    ],
    "target_body_parts": [
      "Thighs",
      "Glutes",
      "Reproductive Organs",
      "Lower Back",
      "Hips"
    ],
    "contraindications": [
      "Knee Injury",
      "Ankle Injury",
      "Pregnancy",
      "Back Injury"
    ],
    "benefits": [
      "Practicing this asana regularly opens the hip joint and stretches a few body parts including, thighs, glutes and piriformis muscles.",
      "It improves the functioning of the urinary and reproductive system.",
      "It increases the flexibility of the hip and also stimulates the internal organs.",
      "It reduces sciatic and lower back pain.",
      "It improves posture, alignment, and overall suppleness."
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 23,
    "sanskrit_name": "Phalakasana",
    "english_name": "Plank",
    "procedure": [
      "Starting in Tabletop Pose, fingers spread, shoulders over your wrists.",
      "Extend your left & right leg out one-by-one, tucking your toes under.",
      "You should be in a high push up position and your body should be in one straight line, from the crown of your head to your heels.",
      "Push the floor away from you, slide your shoulder blades down your spine, and pull your core in to meet your back body.",
      "Engage your core, thighs, and tuck your tailbone.",
      "Gaze gently at the floor slightly in front of you and stay here for 5 breaths, or for as long as you can."
    ],
    "target_body_parts": ["Arms", "Core", "Thighs", "Abdominal Muscle"],
    "contraindications": ["Wrist Injury", "Shoulder Injury", "Back Injury"],
    "benefits": [
      "Strengthens the shoulders, neck, upper arms, forearms, wrists, spine, and abdominal muscles",
      "Improves respiratory system",
      "Improve digestion",
      "Develop the bone density in the arms, back, and legs",
      "Stimulates hormones such as thyroxine",
      "Improve the overall sleep quality"
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 24,
    "sanskrit_name": "Halasana",
    "english_name": "Plow",
    "procedure": [
      "Lie on your back with your arms beside you, palms downwards.",
      "As you inhale, use your abdominal muscles to lift your feet off the floor, raising your legs vertically at a 90-degree angle.",
      "Continue to breathe normally and supporting your hips and back with your hands, lift them off the ground.",
      "Allow your legs to sweep in a 180-degree angle over your head till your toes touch the floor. Your back should be perpendicular to the floor.",
      "Hold this pose and let your body relax more and more with each steady breath.",
      "After about a minute (a few seconds for beginners) of resting in this pose, you may gently bring your legs down on exhalation."
    ],
    "target_body_parts": ["Abdominal Muscle", "Core", "Spine", "Back", "Neck"],
    "contraindications": [
      "Neck Injury",
      "Pregnancy",
      "High Blood Pressure Issues",
      "Diarrhea"
    ],
    "benefits": [
      "Calms the nervous system, reduces stress and fatigue.",
      "Tones the legs and improves leg flexibility.",
      "Stimulates the thyroid gland and strengthens the immune system.",
      "Helps women during menopause.",
      "Strengthens and opens up the neck, shoulders, abs and back muscles."
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 25,
    "sanskrit_name": "Parsvottanasana",
    "english_name": "Pyramid",
    "procedure": [
      "Stand erect and tall in Mountain Pose (Tadasana).",
      "Bring the left foot two to three feet behind the right one, and move into the pyramid stance.",
      "Place your hands behind your back in reverse prayer position.",
      "Keeping your hips square to the front, exhale; hinging from the hips, bend forward over the right leg.",
      "As you breathe in, lengthen your spine, and as you breathe out, bring your torso towards the thigh.",
      "Relax and hold this position for three to five long breaths.",
      "Gently release the posture, and come back to Tadasana.",
      "Repeat with the other leg."
    ],
    "target_body_parts": [
      "Core",
      "Abdominal Muscle",
      "Back",
      "Spine",
      "Hamstrings",
      "Hips",
      "Digestive Organs"
    ],
    "contraindications": ["Pregnancy", "Shoulder Injury", "Back Injury"],
    "benefits": [
      "Helps stretch the hips, legs, and hamstrings",
      "Improves body posture, and balances the body and mind",
      "Massages the abdominal organs, and improves digestion",
      "Calms the mind"
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 26,
    "sanskrit_name": "Parsva Virabhadrasana",
    "english_name": "Reverse Warrior",
    "procedure": [
      "Stand on your mat with hands on the sides.",
      "Place your left leg forward about 2 – 3 feet with feet pointing straight ahead.",
      "Slowly bend your left knees so that the thighs make a 90 degrees angle with the fore legs.",
      "Let the right leg, pointing backwards, maintain an angle of about 45 degrees to the ground.",
      "Let the right hand rest on the right thighs.",
      "Raise the left hand upwards and simultaneously arch the spine forward. The chest is opened up and face and gaze is turned upwards. The left palm points straight to the sky.",
      "Remain in this pose for as long as you are comfortable. This is the final pose for Parsva Virabhadrasana.",
      "To release the pose, bring down the left hand and straighten the left leg. Bring the two feet together again.",
      "Rest for few breaths and repeat the same with the right leg forward."
    ],
    "target_body_parts": ["Hips", "Arms"],
    "contraindications": ["Knee Injury"],
    "benefits": [
      "Parsva Virabhadrasana calms the mind.",
      "It brings balance to the body.",
      "Parsva Virabhadrasana energizes the body.",
      "It stretches the arms and opens up the hips.",
      "This asana opens up the chest and develops core strength."
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 27,
    "sanskrit_name": "Paschimottanasana",
    "english_name": "Seated Forward Bend",
    "procedure": [
      "Begin seated with your legs straight in front of you. Flex your feet and press your heels away from you.",
      "Inhale and sit tall. Exhale and hinge at your hips to lean forward. Lengthen your spine rather than round your back.",
      "Walk your hands as far forward as your back and hamstrings allow you to comfortably stretch. If you can reach your feet, loosely rest your hands on the outer edges. Keep your feet flexed with your knees and toes pointing  toward the ceiling.",
      "With each inhalation, lift and lengthen your chest slightly; with each exhalation, release a little more fully into the forward bend. If your hands are resting on your feet, let your elbows bend out to the sides.",
      "Stay in the pose for 1-3 minutes. To come out, release your feet as you slowly come back to sitting on an inhalation."
    ],
    "target_body_parts": [
      "Legs",
      "Hip",
      "Lower Body",
      "Lower Back",
      "Shoulders"
    ],
    "contraindications": [
      "Pregnancy",
      "Hernia",
      "Lower-back Disorders",
      "High Blood Pressure Issues",
      "Glaucoma"
    ],
    "benefits": [
      "Stretches lower back, hamstrings and hips.",
      "Massages and tones the abdominal and pelvic organs.",
      "Tones the shoulders."
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 28,
    "sanskrit_name": "Padmasana",
    "english_name": "Lotus",
    "procedure": [
      "Sit on the floor with the legs stretched out straight in front.",
      "Bend the right knee and grasp the right foot with both hands and place it on top of the  left thigh bringing the heel as close to the navel as possible.",
      "Bend the left knee and grasp the left foot with both hands and place it on top of the  right thigh bringing the heel as close to the navel as possible.",
      "Both knees should be on the ground and the soles of the feet are pointed upward. The  spine is held straight but not rigid.",
      "The position of the legs may be switched after a period of time if the posture becomes  uncomfortable."
    ],
    "target_body_parts": ["Hip", "Legs", "Lower Back", ""],
    "contraindications": ["Sciatica", "Knee Injury", "Ankle Injury"],
    "benefits": [
      "It may reduce muscular tension by relieving the tight muscle tissues of the body",
      "It may help in opening the hips which can lead to decrease in the load and overuse of the spine.",
      "It may help in lubricating the knees.",
      "It may tone the abdominal region.",
      "Improves digestion",
      "Reduces menstrual discomfort",
      "Helps pregnant ladies during childbirth"
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 29,
    "sanskrit_name": "Ardha Matsyendrasana",
    "english_name": "Half Lord of the Fishes",
    "procedure": [
      "Sit up with the legs stretched out straight in front of you, keeping the feet together and the spine erect.",
      "Bend the left leg and place the heal of the left foot beside the right hip (optionally, you can keep the left leg straight).",
      "Take the right leg over the left knee.",
      "Place the left hand on the right knee and the right hand behind you.",
      "Twist the waist, shoulders and neck in this sequence to the right and look over the right shoulder.",
      "Keep the spine erect.",
      "Hold and continue with gentle long breaths in and out.",
      "Breathing out, release the right hand first (the hand behind you), release the waist, then chest,lastly the neck and sit up relaxed yet straight.",
      "Repeat to the other side.",
      "Breathing out, come back to the front and relax."
    ],
    "target_body_parts": ["Spine", "Abdominal Muscle", "Respiratory Muscles"],
    "contraindications": [
      "Hernia",
      "Peptic Ulcer",
      "Spinal Disorders",
      "Pregnancy",
      "Menstrual Cycle"
    ],
    "benefits": [
      "Makes spine supple.",
      "Increases the elasticity of the spine.",
      "Opens the chest and increases the oxygen supply to the lungs."
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 30,
    "sanskrit_name": "Sarvangasana",
    "english_name": "Shoulder Stand",
    "procedure": [
      "From the Corpse Pose, raise your legs up and bring it to 90 degrees and remain here for a few breaths.",
      "Inhale and raise the leg up higher by placing the arms and on the floor and supporting the lower back with the palms. Exhale completely and take the body higher in the pose.",
      "Bring the chest close to the face and watch the breathing and as the body exhales stay there and with every inhalation stretch the body upwards putting the shoulder firm on the floor.",
      "The body stands now on the Shoulders thus giving it the name Shoulderstand Pose or Sarvangasana. Using the abdominal strength stay longer to about 10 breaths and work on keeping the body light and loose."
    ],
    "target_body_parts": ["Neck", "Shoulders", "Spine", "Abdominal Muscle"],
    "contraindications": [
      "Back Injury",
      "Spondylitis",
      "High Blood Pressure Issues",
      "Pregnancy",
      "Menstrual Cycle",
      "Throat or Ear Infection"
    ],
    "benefits": [
      "Stimulates the thyroid and parathyroid glands which in turn balances hormones in both males and females.",
      "As the flow of blood is reversed, there is increased blood flow to the brain.",
      "The heart muscles are stretched as the reversed blood flow requires the heart to work harder to pump blood to the extremities.",
      "Improves digestion and relieves constipation.",
      " Burns fat around the tummy, buttocks, thighs, and hips.",
      "Strengthens nervous system and back."
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 31,
    "sanskrit_name": "Vasisthasana",
    "english_name": "Side Plank",
    "procedure": [
      "Come into Dandasana (Plank pose).",
      "Slowly shift your weight on the right arm and foot as you swing your left arm and foot on it.",
      "Rest the left foot on the right foot and let the left arm rest on the hip.",
      "The right hand should be a little in front of the shoulder and not exactly below it.",
      "Also, ensure that the palm is pressed firmly against the floor and the arm is not bent.",
      "As you inhale, slowly raise your left arm till it is perpendicular to the floor with fingertips pointing towards the ceiling.",
      "Now turn your neck towards the raised arm and gaze at the fingertips for a few breaths",
      "As you exhale, bring the arm down to rest on the hip.",
      "Slowly come back into Dandasana and rest for a few breaths.",
      "Repeat the process on the other side."
    ],
    "target_body_parts": ["Arms", "Legs", "Abdominal Muscle"],
    "contraindications": ["Wrist Injury", "Shoulder Injury", "Elbow Injury"],
    "benefits": [
      "Strengthens the arms, wrists and legs.",
      "Strengthens the abdomen.",
      "Improves balance."
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 32,
    "sanskrit_name": "Salamba Bhujangasana",
    "english_name": "Sphinx pose",
    "procedure": [
      "Lie on your stomach with your toes flat on the floor and forehead resting on the ground.",
      "Keep your legs close together, with your feet and heels lightly touching each other.",
      "Stretch your hands in front of you with palms facing downward and arms touching the ground.",
      "Taking a deep breath in, slowly lift your head, chest and abdomen while keeping your navel on the floor.",
      "Pull your torso back and off the floor with support of your arms.",
      "Keep breathing with awareness, as you curve your spine vertebra by vertebra.",
      "Ensure that your feet are still close together and head facing straight ahead.",
      "Breathing out, gently bring down your abdomen, chest and head back to the floor."
    ],
    "target_body_parts": ["Spine", "Chest", "Shoulders"],
    "contraindications": ["Pregnancy", "Wrist Injury", "Spine Injury"],
    "benefits": [
      "Strengthens the spine",
      "Stretches chest and lungs, shoulders, and abdomen",
      "Firms the buttocks",
      "Stimulates abdominal organs",
      "Helps relieve stress"
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 33,
    "sanskrit_name": "Hanumanasana",
    "english_name": "Splits/ Monkey Pose",
    "procedure": [
      "Start by kneeling on the floor with knees a little apart. Place your right foot forward and raise the inner sole such that only the outer heel touches the floor.",
      "As you exhale, bend your torso forward and bring your fingertips to touch the floor.",
      "Slowly, move your left knee backward till the knee and the front of the foot touch the ground. Simultaneously slide your right leg forward till it touches the floor completely.",
      "Sliding your left foot backward and right foot forward, come into a split position.",
      "The toes of the right foot should be pointing skywards and the front of the left foot should be touching the ground.",
      "Raise your arms and join your palms. Stretch your arms and arch your back a little.",
      "Stay in this position for a couple of breaths before bringing your arms back down.",
      "To come out of this posture, shift the weight of the body on the hands by pressing them on the floor. Slowly slide your left and right feet back to the initial position before repeating the pose with the left leg in front and right leg behind."
    ],
    "target_body_parts": ["Lower Body", "Hamstrings", "Glutes"],
    "contraindications": ["Hamstring Injury"],
    "benefits": [
      "Stretches the hamstrings, glutes, groins, and quadriceps",
      "Improves core strength and body awareness"
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 34,
    "sanskrit_name": "Malasana",
    "english_name": "Squat/Garland Pose",
    "procedure": [
      "Come to stand with your feet about mat's width apart.",
      "Bend the knees and lower your butt toward the floor to come into a squat.",
      "It's natural for your toes to want to turn out and that's OK, but don't overdo it. Eventually, you're working toward keeping the feet closer to parallel.",
      "Take your upper arms inside your knees and bend the elbows to bring the palms together into anjali mudra (prayer position).",
      "With hands to your heart center in anjali mudra, see if you can allow your thumbs to touch your sternum as if to help keep the chest lifted. Continue pressing upper arms into thighs and thighs into upper arm to stay engaged.",
      "Keep your spine straight, your butt moving toward the floor, and your shoulders relaxed away from your ears.",
      "Stay here for five breaths, then straighten the legs to come out.",
      "Try repeating the pose three times to take full advantage of getting warmed up. If you are practicing at home, it's fine to do some other poses in between your squats."
    ],
    "target_body_parts": ["Hamstrings", "Glutes", "Groins", "Quadriceps"],
    "contraindications": ["Knee Injury", "Lower-back Injury"],
    "benefits": [
      "Stretches the ankles, groins and back torso",
      "Tones the belly"
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 35,
    "sanskrit_name": "Uttanasana",
    "english_name": "Standing Forward Bend",
    "procedure": [
      "Start in Tadasana (Mountain Pose), stand with feet hip-width apart, arms by your sides, and weight evenly distributed on both feet.",
      "Inhale, lift your arms overhead, and extend the spine and reach up through the fingertips",
      "Exhale, hinge at the hips and bend forward from your waist, keeping the spine long.",
      "Bring your hands to the floor and place them beside or slightly in front of your feet.",
      "Relax the head and neck, allow gravity to pull the head down, and maintain a gentle bend in the knees if needed.",
      "Hold for 30 seconds to a minute and breathe deeply, feeling the stretch along the back of the legs and spine.",
      "To release, inhale and lift the torso and return to the standing position with a flat back."
    ],
    "target_body_parts": ["Hamstrings", "Calves"],
    "contraindications": [
      "Back Injury",
      "Pregnancy",
      "High Blood Pressure Issues"
    ],
    "benefits": [
      "Stretches and lengthens the hamstrings and calves.",
      "Relaxing and stress-relieving pose",
      "Help relieve insomnia"
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 36,
    "sanskrit_name": "Ashta Chandrasana",
    "english_name": "Crescent Moon",
    "procedure": [],
    "target_body_parts": [],
    "contraindications": [],
    "benefits": [],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 37,
    "sanskrit_name": "Upavistha Konasana",
    "english_name": "Side Splits",
    "procedure": [
      "Start with Staff pose and sit upright on top of your pelvic bones.",
      "Sit with your legs extended and your arms relaxed at your sides in the Staff pose. Inhale and exhale for a few seconds here.",
      "Now, spread your legs slowly, as wide as possible, and place your hands flat on the mat.",
      "Inhale deep, and lengthen your spine all the way up to the crown of your head. Exhale, bend at your waist, and press down through the backs of your legs.",
      "Walk your hands forward as far as you can go. Keep your back straight and your spine parallel to the ground.",
      "Hold this position for a few deep breaths and then gently exit the pose by getting up in the staff pose."
    ],
    "target_body_parts": [
      "Lower Back",
      "Lower Body",
      "Hamstrings",
      "Glutes",
      "Spine",
      "Legs",
      "Abdominal Muscle"
    ],
    "contraindications": [
      "Spondylitis",
      "Slipped disc",
      "Pregnant",
      "Lower-back Injury"
    ],
    "benefits": [
      "Improves knee and hip joint mobility.",
      "Improves digestion and sexual health.",
      "Stretches the spine and shoulders. ",
      "Strengthens the legs, ankles, hamstrings, glutes, and spine. ",
      "Burns excess fat around the thighs and core. "
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 38,
    "sanskrit_name": "Vrksasana",
    "english_name": "Tree",
    "procedure": [
      "Take a moment to feel both your feet root into the floor, your weight distributed equally on all four corners of each foot.",
      "Begin to shift your weight into your right foot, lifting your left foot off the floor. ",
      "Keep your right leg straight but don't lock the knee.",
      "Bend your left knee and bring the sole of your left foot high onto your inner right thigh. ",
      "Press your foot into your thigh and your thigh back into your foot with equal pressure.This will help you keep both hips squared toward the front so your right hip doesn't jut out.",
      "Focus your gaze (Drishti) on something that doesn't move to help you keep your balance",
      "Take 5 to 10 breaths, then lower your left foot to the floor and do the other side."
    ],
    "target_body_parts": ["Entire Body", "Legs"],
    "contraindications": ["Knee Injury", "Migraine headaches"],
    "benefits": [
      "Increases concentration",
      "Improves physical balance and mental resilience ",
      "Helps relieve sciatica",
      "Strengthens the legs",
      "Opens the hips",
      "Boosts energy",
      "Strengthens your core",
      "Improves your posture and alignment"
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 39,
    "sanskrit_name": "Trikonasana",
    "english_name": "Triangle",
    "procedure": [
      "Stand straight. Separate your feet comfortably wide apart (about 31/2 to 4 feet).",
      "Turn your right foot out 90 degrees and left foot in by 15 degrees.",
      ",Now align the center of your right heel with the center of your arch of left foot.",
      ",Ensure that your feet are pressing the ground and the weight of your body is equally balanced on both the feet.",
      ",Inhale deeply and as you exhale, bend your body to the right, downward from the hips, keeping the waist straight, allowing your left hand to come up in the air while your right hand comes down towards floor. Keep both arms in straight line.",
      ",Rest your right hand on your shin, ankle, or the floor outside your right foot, whatever is possible without distorting the sides of the waist. Stretch your left arm toward the ceiling, in line with the tops of your shoulders. Keep your head in a neutral position or turn it to the left, eyes gazing softly at the left palm.",
      "Stretch maximum and be steady. Keep taking in long deep breaths. With each exhalation, relax the body more and more. Just be with the body and the breath.",
      "As you inhale, come up, bring your arms down to your sides, and straighten your feet.",
      "Repeat the same on the other side."
    ],
    "target_body_parts": [
      "Legs",
      "Spine",
      "Abdominal Muscle",
      "Hamstrings",
      "Hips"
    ],
    "contraindications": [
      "Migraine",
      "Diarrhea",
      "Low or high blood pressure issue",
      "Neck Injury",
      "Back Injury"
    ],
    "benefits": [
      "It strengthens the legs, knees, ankles, arms and chest",
      "It stretches and opens the hips, groins, hamstrings, calves, shoulders, chest and spine",
      "It increases mental and physical equilibrium and improves digestion",
      "It reduces anxiety, stress, back pain and sciatica"
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 40,
    "sanskrit_name": "Urdhva Mukha Svsnssana",
    "english_name": "Upward-Facing Dog",
    "procedure": [
      "Lie flat on your belly with the top of your feet facing downwards. Your arms should be stretched down the length of the body.",
      "Bend your elbows and spread your palms beside the lowest rib.",
      "As you inhale, press your palms firmly on the mat and slowly lift your torso, hips and knees off the mat. The entire weight of the body should be resting on the palms and top of the feet.",
      "You may look straight ahead or tilt your head slightly backwards.",
      "Ensure that your wrists are in line with your shoulders and the neck is not strained. Stay in this pose for a couple of breaths.",
      "As you exhale, slowly lower your knees, hips and torso back on the mat."
    ],
    "target_body_parts": ["Spine", "Abdominal Muscle", "Lower Back"],
    "contraindications": [
      "Carpel Tunnel Syndrome",
      "Back Injury",
      "Spine Injury",
      "Pregnancy"
    ],
    "benefits": [
      "Stretches and strengthens the back, thus relieving the body of lower back ache.",
      "Most of the body weight is borne by the arms and wrists, thus strengthening them.",
      "This yoga pose helps improve the body posture and also stimulates the abdominal organs."
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  },
  {
    "id": 41,
    "sanskrit_name": "Urdhva Dhanurasana",
    "english_name": "Wheel",
    "procedure": [
      "First, lie flat on your back on a mat.",
      "Bend and raise your elbows over your head and place your palms under your shoulders.",
      "Ensure your fingers are pointing towards your feet.",
      "Next, bend and raise your knees while bringing the feet nearer until they touch the hips.",
      "While resting the crown/top of your head on the floor, raise the trunk.",
      "Next, lift the trunk and head so that the back is arched and the weight of the body is now on the palms and soles.",
      "Stretch your arms until the elbows are straight.",
      "For a better stretch, breathe out and try lifting the heels off the ground.",
      "With normal breathing, try to hold this position for about 30-60 seconds or however, is long is comfortable.",
      "Breathe out, return to the original position and relax your body."
    ],
    "target_body_parts": [
      "Arms",
      "Shoulders",
      "Legs",
      "Spine",
      "Respiratory Muscles"
    ],
    "contraindications": [
      "Carpel Tunnel Syndrome",
      "Back Injury",
      "Spine Injury",
      "Pregnancy"
    ],
    "benefits": [
      "Opens the chest and increases the oxygen supply to the lungs.",
      "It also massages the kidneys and stimulates the adrenal glands"
    ],
    "created_at": "",
    "updated_at": "",
    "image_url": "",
    "yt_videos": []
  }
]
